In [1]:
import pandas as pd
from sqlalchemy import create_engine

In [3]:
csv_file = "Resources/GeneralEsportData.csv"
Esport_data_df = pd.read_csv(csv_file)
Esport_data_df.head()

,Game,ReleaseDate,Genre,TotalEarnings,OnlineEarnings,TotalPlayers,TotalTournaments
0,Age of Empires,1997,NaN,190262.81,156839.89,255,96
1,Age of Empires II,1999,NaN,2008941.78,619582.87,1392,1031
2,Age of Empires III,2005,NaN,68613.85,41500.00,108,77
3,Age of Empires Online,2011,NaN,4853.56,775.00,20,13
4,Age of Mythology,2002,NaN,52360.00,52000.00,22,6

In [4]:
Country_file = "Resources/country-and-continent-codes-list.csv"
Country_data_df = pd.read_csv(Country_file)
Country_data_df.head()

,Continent_Name,Continent_Code,Country_Name,Two_Letter_Country_Code,Three_Letter_Country_Code,Country_Number
0,Asia,AS,"Afghanistan, Islamic Republic of",AF,AFG,4.0
1,Europe,EU,"Albania, Republic of",AL,ALB,8.0
2,Antarctica,AN,Antarctica (the territory South of 60 deg S),AQ,ATA,10.0
3,Africa,AF,"Algeria, People's Democratic Republic of",DZ,DZA,12.0
4,Oceania,OC,American Samoa,AS,ASM,16.0

In [5]:
# Creating a database connection
rds_connection_string = "postgres:postgres@localhost:5432/gaming_db"
engine = create_engine(f'postgresql://{rds_connection_string}')

In [6]:
# Confirm tables
engine.table_names()

<ipython-input-6-2d97e9123e98>:2: SADeprecationWarning: The Engine.table_names() method is deprecated and will be removed in a future release.  Please refer to Inspector.get_table_names(). (deprecated since: 1.4)
  engine.table_names()

[]

In [8]:
# Loading tables into gaming_db
Esport_data_df.to_sql(name='Esport_data',con=engine,if_exists='append', index=False)

In [ ]:
Country_data_df.to_sql(name='Esport_data',con=engine,if_exists='append', index=False)